#pragma once
#include <SFML/Graphics.hpp>
const int HEIGHT_MAP = 21;//размер карты высота
const int WIDTH_MAP = 49;//размер карты ширина 


sf::String TileMap[HEIGHT_MAP] = {
	"0000000000000000000000000000000000000000000000000",
	"0                       1                       0",
	"0                       1                       0",
	"0                       1                       0",
	"0                       1                       0",
	"0                       1                       0",
	"0========B              1              P========0",
	"0        1              1              1        0",
	"0www     1              1              1     www0",
	"0   i    3==B         P=2=B         P==4    j   0",
	"0   |    1  1         1 1 1         1  1    l   0",
	"0   |    1  1         L=2=N         1  1    l   0",
	"0   b    3==N           1           L==4    k   0",
	"0www     1              1              1     www0",
	"0        1              1              1        0",
	"0========N              1              L========0",
	"0                       1                       0",
	"0                       1                       0",
	"0                       1                       0",
	"0                       1                       0",
	"0000000000000000000000000000000000000000000000000",
};