#pragma once
#include <SFML/Graphics.hpp>
const int HEIGHT_MAP = 21;//размер карты высота
const int WIDTH_MAP = 49;//размер карты ширина 


sf::String TileMap[HEIGHT_MAP] = {
	"0000000000000000000000000000000000000000000000000",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0www                                         www0",
	"0   i                                       j   0",
	"0   |                                       l   0",
	"0   |                                       l   0",
	"0   b                                       k   0",
	"0www                                         www0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0                                               0",
	"0000000000000000000000000000000000000000000000000",
};